

<!--Создание диапазона чисел-->
<!---->
<!--list range(int $l, int $hi)-->

<!--<table>-->
<?php //foreach (range(1,50) as $A) {?>
<!--<tr>-->
<!--<td>--><?//= $A ?><!--</td>-->
<!--<td>Это вывод кодв номер этой строки --><?//= $A ?><!--</td>-->
<!--</tr>-->
<?// } ?>
<!--</table>-->


<table>
    <?php for ($A = 1; $A <= 50; $A++) { ?>
        <tr>
            <td><?= $A ?></td>
            <td>Это php строка номер <?= $A ?></td>
        </tr>
    <? } ?>
</table>






























